src/cf/Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СпецификацииНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// В программе наименование основной спецификации, если она всего одна, совпадает с наименованием продукции
//
Процедура ИсправитьНаименованиеСпецификации(ОсновнаяСпецификацияНоменклатуры, Номенклатура, Наименование) Экспорт
	
	Если Не ЗначениеЗаполнено(ОсновнаяСпецификацияНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НесколькоСпецификацийНоменклатуры(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеСпецификации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяСпецификацияНоменклатуры, "Наименование");
	
	Если НаименованиеСпецификации = Наименование Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОсновнаяСпецификация = ОсновнаяСпецификацияНоменклатуры.ПолучитьОбъект();
	ОбъектОсновнаяСпецификация.Наименование = Наименование;
	ОбъектОсновнаяСпецификация.Записать();
	
КонецПроцедуры

Функция НесколькоСпецификацийНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СправочникСпецификаций.Ссылка) КАК КоличествоСпецификаций
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры КАК СправочникСпецификаций
	|ГДЕ
	|	СправочникСпецификаций.Владелец = &Номенклатура
	|	И СправочникСпецификаций.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСпецификаций > 1;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
